brew "git"
cask "1password"
cask "alt-tab"
cask "discord"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "notion"
cask "onedrive"
cask "slack"
cask "visual-studio-code"
vscode "github.copilot"
vscode "github.copilot-chat"
