brew "claude-code-router"
brew "git"
brew "graphviz"
brew "nodebrew"
brew "python@3.13"
brew "pipx"
cask "1password"
cask "alt-tab"
cask "claude-code"
cask "discord"
cask "docker-desktop"
cask "google-chrome"
cask "google-japanese-ime"
cask "interact-scratchpad"
cask "karabiner-elements"
cask "logi-options+"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "notion"
cask "onedrive"
cask "scroll-reverser"
cask "slack"
cask "temurin"
cask "visual-studio-code"
vscode "1yib.rust-bundle"
vscode "charliermarsh.ruff"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.colab"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jinxdash.prettier-rust"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
